from typing import Dict, Any

def high_yield_cashback_categories(data: dict, year: int, month: int) -> dict:
    """Сервис позволяет проанализировать, какие категории были
     наиболее выгодными для выбора в качестве категорий
     повышенного кешбэка.
        Функция для анализа выгодности категорий повышенного
    кешбэка.
    На вход функции поступают данные для анализа, год и месяц.
    Входные параметры:
    :data — данные с транзакциями;
    :year - год, за который проводится анализ;
    :month - месяц, за который проводится анализ.
    """
    pass

def search_for_transfers_to_individuals()->dict:
    """Функция возвращает JSON со всеми транзакциями, которые относятся к переводам физлицам.
        Категория такой транзакции — Переводы, а в описании
        есть имя и первая буква фамилии с точкой.
        Например:
        Валерий А.
        Сергей З.
        Артем П."""
